index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MAT5939-03 ACM Computing Seminar – Fall 2016</title>
<!-- 2016-08-29 Mon 09:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Matt Hancock" />
<link rel="stylesheet" type="text/css" href="css/main.css">
</head>
<body>
<div id="content">
<h1 class="title">MAT5939-03 ACM Computing Seminar – Fall 2016</h1>
<div id="main">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Course Information <a href="./syllabus.html">(syllabus)</a></h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>Time &amp; Place:</b></td>
<td class="left">Monday 6:45PM - 8:00PM, LOV 102</td>
</tr>

<tr>
<td class="left"><b>Instructor:</b></td>
<td class="left">Matt Hancock</td>
</tr>

<tr>
<td class="left"><b>Office Hours:</b></td>
<td class="left">Tues 12-2, Thurs 2-4, 409 B MCH</td>
</tr>

<tr>
<td class="left"><b>Email:</b></td>
<td class="left"><a href="mailto:mhancock@math.fsu.edu?subject=MAT5939%20...%20">mhancock@math.fsu.edu</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Assignments</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="center" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="center">Week</th>
<th scope="col" class="left">Assignment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="center">1 <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-08-29 Mon&gt;</span></span></td>
<td class="left">Install gcc / g++; write and compile "hello world".</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Resources</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Programming Language Guides</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="./resources/langs/cpp/">C++ guide</a>
</li>
<li><a href="./resources/langs/fortran/">Fortran guide</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Programming assignment resources</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="./resources/prog/assignment-template.zip">Programming assignment template</a> (Read the README!)
</li>
<li><a href="./resources/prog/example-assignment.zip">Example programming assignment and solution</a>
</li>
</ul>

</div>
</div>
</div>
</div>
</div>
</body>
</html>
